Revit 2026 API

# DuctSettingsCenterline Property

---

The abbreviation of the Centerline (=) string.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string Centerline { get; set; }
```
```vb
Public Property Centerline As String
	Get
	Set
```
```cpp
public:
property String^ Centerline {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member Centerline : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

DuctSettings Class

Autodesk.Revit.DB.Mechanical Namespace